evidence/OPS-2203/k6-before.txt
===============================================================================
OPS-2203 BEFORE — full investigation, re-established in current state
This RE-ESTABLISHES the before numbers prior to the real fix (moving the
500 ms notifyBedRegistry call OUT of the admit transaction).
TREATMENT VERIFIED (docker compose exec env, running container):
  MYSQL_POOL_SIZE=25   MAX_INFLIGHT=32
Script: reproduce-OPS-2203.js — 500 VUs, 30s, all POST /api/hospitals/1/admit
Measured input: W_admit = 508.86 ms at 1 VU (evidence/baseline/service-time-1vu.txt)
innodb_lock_wait_timeout = 5s (verified via SHOW VARIABLES)
Started: 2026-08-18T06:20:40Z UTC (unix 1787034040)
===============================================================================


         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-tests/reproduce-OPS-2203.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m0s max duration (incl. graceful stop):
              * admissions_surge: 500 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 500/500 VUs, 11706 complete and 0 interrupted iterations
admissions_surge   [   3% ] 500 VUs  01.0s/30s

running (0m02.0s), 500/500 VUs, 27056 complete and 0 interrupted iterations
admissions_surge   [   7% ] 500 VUs  02.0s/30s

running (0m03.0s), 500/500 VUs, 41958 complete and 0 interrupted iterations
admissions_surge   [  10% ] 500 VUs  03.0s/30s

running (0m04.0s), 500/500 VUs, 54735 complete and 0 interrupted iterations
admissions_surge   [  13% ] 500 VUs  04.0s/30s

running (0m05.0s), 500/500 VUs, 69041 complete and 0 interrupted iterations
admissions_surge   [  17% ] 500 VUs  05.0s/30s

running (0m06.0s), 500/500 VUs, 83575 complete and 0 interrupted iterations
admissions_surge   [  20% ] 500 VUs  06.0s/30s

running (0m07.0s), 500/500 VUs, 98895 complete and 0 interrupted iterations
admissions_surge   [  23% ] 500 VUs  07.0s/30s

running (0m08.0s), 500/500 VUs, 113933 complete and 0 interrupted iterations
admissions_surge   [  27% ] 500 VUs  08.0s/30s

running (0m09.0s), 500/500 VUs, 128701 complete and 0 interrupted iterations
admissions_surge   [  30% ] 500 VUs  09.0s/30s

running (0m10.0s), 500/500 VUs, 143488 complete and 0 interrupted iterations
admissions_surge   [  33% ] 500 VUs  10.0s/30s

running (0m11.0s), 500/500 VUs, 158434 complete and 0 interrupted iterations
admissions_surge   [  37% ] 500 VUs  11.0s/30s

running (0m12.0s), 500/500 VUs, 171695 complete and 0 interrupted iterations
admissions_surge   [  40% ] 500 VUs  12.0s/30s

running (0m13.0s), 500/500 VUs, 186478 complete and 0 interrupted iterations
admissions_surge   [  43% ] 500 VUs  13.0s/30s

running (0m14.0s), 500/500 VUs, 200462 complete and 0 interrupted iterations
admissions_surge   [  47% ] 500 VUs  14.0s/30s

running (0m15.0s), 500/500 VUs, 215163 complete and 0 interrupted iterations
admissions_surge   [  50% ] 500 VUs  15.0s/30s

running (0m16.0s), 500/500 VUs, 229198 complete and 0 interrupted iterations
admissions_surge   [  53% ] 500 VUs  16.0s/30s

running (0m17.0s), 500/500 VUs, 244053 complete and 0 interrupted iterations
admissions_surge   [  57% ] 500 VUs  17.0s/30s

running (0m18.0s), 500/500 VUs, 257464 complete and 0 interrupted iterations
admissions_surge   [  60% ] 500 VUs  18.0s/30s

running (0m19.0s), 500/500 VUs, 270267 complete and 0 interrupted iterations
admissions_surge   [  63% ] 500 VUs  19.0s/30s

running (0m20.0s), 500/500 VUs, 284333 complete and 0 interrupted iterations
admissions_surge   [  67% ] 500 VUs  20.0s/30s

running (0m21.0s), 500/500 VUs, 298882 complete and 0 interrupted iterations
admissions_surge   [  70% ] 500 VUs  21.0s/30s

running (0m22.0s), 500/500 VUs, 313797 complete and 0 interrupted iterations
admissions_surge   [  73% ] 500 VUs  22.0s/30s

running (0m23.0s), 500/500 VUs, 328475 complete and 0 interrupted iterations
admissions_surge   [  77% ] 500 VUs  23.0s/30s

running (0m24.0s), 500/500 VUs, 338675 complete and 0 interrupted iterations
admissions_surge   [  80% ] 500 VUs  24.0s/30s

running (0m25.0s), 500/500 VUs, 352313 complete and 0 interrupted iterations
admissions_surge   [  83% ] 500 VUs  25.0s/30s

running (0m26.0s), 500/500 VUs, 365849 complete and 0 interrupted iterations
admissions_surge   [  87% ] 500 VUs  26.0s/30s

running (0m27.0s), 500/500 VUs, 380966 complete and 0 interrupted iterations
admissions_surge   [  90% ] 500 VUs  27.0s/30s

running (0m28.0s), 500/500 VUs, 395965 complete and 0 interrupted iterations
admissions_surge   [  93% ] 500 VUs  28.0s/30s

running (0m29.0s), 500/500 VUs, 410995 complete and 0 interrupted iterations
admissions_surge   [  97% ] 500 VUs  29.0s/30s

running (0m30.0s), 500/500 VUs, 425470 complete and 0 interrupted iterations
admissions_surge   [ 100% ] 500 VUs  30.0s/30s

running (0m31.0s), 030/500 VUs, 426178 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m32.0s), 028/500 VUs, 426180 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m33.0s), 026/500 VUs, 426182 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m34.0s), 024/500 VUs, 426184 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m35.0s), 022/500 VUs, 426186 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m36.0s), 006/500 VUs, 426202 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m37.0s), 004/500 VUs, 426204 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s

running (0m38.0s), 002/500 VUs, 426206 complete and 0 interrupted iterations
admissions_surge ↓ [ 100% ] 500 VUs  30s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=42.49ms

    http_req_failed
    ✗ 'rate<0.05' rate=99.98%


  █ TOTAL RESULTS 

    checks_total.......: 426208 10987.598194/s
    checks_succeeded...: 0.01%  69 out of 426208
    checks_failed......: 99.98% 426139 out of 426208

    ✗ status is 200
      ↳  0% — ✓ 69 / ✗ 426139

    HTTP
    http_req_duration..............: avg=34.39ms min=522µs    med=30.38ms max=10.61s p(90)=38.17ms p(95)=42.49ms
      { expected_response:true }...: avg=8.03s   min=566.9ms  med=8.85s   max=10.61s p(90)=10.03s  p(95)=10.06s 
    http_req_failed................: 99.98% 426139 out of 426208
    http_reqs......................: 426208 10987.598194/s

    EXECUTION
    iteration_duration.............: avg=35.57ms min=566.33µs med=30.4ms  max=12.61s p(90)=38.21ms p(95)=42.59ms
    iterations.....................: 426208 10987.598194/s
    vus............................: 2      min=2                max=500
    vus_max........................: 500    min=500              max=500

    NETWORK
    data_received..................: 143 MB 3.7 MB/s
    data_sent......................: 62 MB  1.6 MB/s



running (0m38.8s), 000/500 VUs, 426208 complete and 0 interrupted iterations
admissions_surge ✓ [ 100% ] 500 VUs  30s
time="2026-08-18T09:21:19+03:00" level=error msg="thresholds on metrics 'http_req_failed' have been crossed"

run window (unix): 1787034040 -> 1787034079